In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'id':[1,2,3,4],
                  'name':['A','B','C','D'],
                  'class':[5,6,7,8]

    
})
df1

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [4]:
df2=pd.DataFrame({'id':[3,4],
                  'name':['C','D'],
                  'class':[7,8]

    
})
df2

   id name  class
0   3    C      7
1   4    D      8

In [5]:
pd.concat([df1,df2])

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   3    C      7
1   4    D      8

In [6]:
pd.concat([df1,df2],axis=1)

   id name  class   id name  class
0   1    A      5  3.0    C    7.0
1   2    B      6  4.0    D    8.0
2   3    C      7  NaN  NaN    NaN
3   4    D      8  NaN  NaN    NaN

In [7]:
pd.concat([df1,df2],axis=1,join='inner') #intersection

   id name  class  id name  class
0   1    A      5   3    C      7
1   2    B      6   4    D      8

In [8]:
pd.concat([df1,df2],axis=1,join='outer')   #union

   id name  class   id name  class
0   1    A      5  3.0    C    7.0
1   2    B      6  4.0    D    8.0
2   3    C      7  NaN  NaN    NaN
3   4    D      8  NaN  NaN    NaN

In [13]:
pd.concat([df1,df2],axis=1,ignore_index=[df1.index])

   0  1  2    3    4    5
0  1  A  5  3.0    C  7.0
1  2  B  6  4.0    D  8.0
2  3  C  7  NaN  NaN  NaN
3  4  D  8  NaN  NaN  NaN

In [14]:
pd.concat([df1,df2],axis=1,ignore_index=[df2.index])

   0  1  2    3    4    5
0  1  A  5  3.0    C  7.0
1  2  B  6  4.0    D  8.0
2  3  C  7  NaN  NaN  NaN
3  4  D  8  NaN  NaN  NaN

In [17]:
pd.concat([df1,df2],keys=['df1','df2'])

       id name  class
df1 0   1    A      5
    1   2    B      6
    2   3    C      7
    3   4    D      8
df2 0   3    C      7
    1   4    D      8

In [18]:
pd.concat([df1,df2],keys=['df1','df2'],axis=1)

  df1             df2
   id name class   id name class
0   1    A     5  3.0    C   7.0
1   2    B     6  4.0    D   8.0
2   3    C     7  NaN  NaN   NaN
3   4    D     8  NaN  NaN   NaN

In [19]:
df1

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [21]:
df3=pd.DataFrame({'marks':[20,30,40,50]})
df3

   marks
0     20
1     30
2     40
3     50

In [22]:
pd.concat([df1,df3])

    id name  class  marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
0  NaN  NaN    NaN   20.0
1  NaN  NaN    NaN   30.0
2  NaN  NaN    NaN   40.0
3  NaN  NaN    NaN   50.0